app/controllers/users_controller.rb

SELECT "users"."id", "users"."username" FROM "users" WHERE "users"."username" = ? AND "users"."password" = ?  [["username", "qweqwe"], ["password", "qweqwe"]]
SELECT  "users".* FROM "users" WHERE "users"."username" = ? AND "users"."password" = ? LIMIT ?  [["username", "javier"], ["password", "medina"], ["LIMIT", 1]]
---
  def login
    user_name = params[:username]
    user_password = params[:password]
    user_attributes = User.where(username: user_name, password: user_password).pluck(:id, :username)

    if user_attributes.present?

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "alvarito"], ["LIMIT", 1]]
INSERT INTO "users" ("username", "password", "created_at", "updated_at", "email") VALUES (?, ?, ?, ?, ?)  [["username", "pepito"], ["password", "pepito2"], ["created_at", 2017-04-08 11:33:44 UTC], ["updated_at", 2017-04-08 11:33:44 UTC], ["email", "pepito@gmail.com"]]
---
  def register
    user_name = params[:username]
    user_password = params[:password]
    user_email = params[:email]
    userIsUnique = User.where(username: user_name).or(User.where(email: user_email))
    binding.pry
    if !userIsUnique.present?
      user = User.new(username: user_name, password: user_password, email: user_email)
      user.save